Courses/7370/Lectures/DistFileSys/IPFS/DAPPS/dpps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-07-23 Tue 19:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pmNotes dApps</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Prabhaker Mateti" />
<meta name="description" content="Mateti: Android Internals and Security"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../"> ../../</a>
</div>
<div id="content">
<h1 class="title">pmNotes dApps</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd8f3e49">1. Independent Study</a>
<ul>
<li><a href="#org25b7ac2">1.1. Independent Study Course, in General</a></li>
<li><a href="#org0d4a3f0">1.2. Independent Study Course, This One</a></li>
<li><a href="#orge14e612">1.3. Overview</a></li>
<li><a href="#org5447d6b">1.4. IPFS</a></li>
<li><a href="#orgdea2490">1.5. NuCypher</a></li>
<li><a href="#orgf0ec878">1.6. dApps</a></li>
<li><a href="#org10a9c8e">1.7. Topics Beyond the Scope of this Study</a></li>
</ul>
</li>
<li><a href="#org9f5178b">2. Capstone Project</a>
<ul>
<li><a href="#org2447569">2.1. Jayal's Project</a></li>
<li><a href="#orgeeb735c">2.2. Must Do</a></li>
<li><a href="#org56cd57b">2.3. Hako</a></li>
<li><a href="#org0b85c3f">2.4. NuCypher Chrome Extension</a></li>
<li><a href="#org58f6614">2.5. Appendices</a></li>
</ul>
</li>
<li><a href="#org165bf91">3. Example dApps</a></li>
<li><a href="#org5851496">4. Snowden</a></li>
<li><a href="#orgc68b065">5. References</a></li>
<li><a href="#orge378342">6. End</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgd8f3e49" class="outline-2">
<h2 id="orgd8f3e49"><span class="section-number-2">1</span> Independent Study</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org25b7ac2" class="outline-3">
<h3 id="org25b7ac2"><span class="section-number-3">1.1</span> Independent Study Course, in General</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>This description is applicable to all 6970 courses.  TBD Link to form.</li>
<li>A Graduate Independent Study course (6970) is similar to a regular
course such as 6420 Host Computer Security, except there are no
scheduled lectures by a professor, no homweorks, no labs, and no
exams.</li>

<li>The work put in by the student shoudl be comparable to that of a
regular course of the same number of credit hours.</li>

<li>A Final Report must be submitted near the end of the term.  It must
be written as a proper tech report.  Follow the guidelines (e.g.,
WSU graduate school).  The report should convince its readers that
tye student has learned the material.  Comparable to quality and
quantity to that of a regular course. There is no definitive
length.  Something shorter than 50pp is too short, longer than
100pp is too long.</li>

<li>A typical indep study expects one or more demonstrable project
running on Linux or Windows.  The scope of these ought to be
similar to the lab experiments of CEG 4420/6420.</li>
</ol>
</div>
</div>

<div id="outline-container-org0d4a3f0" class="outline-3">
<h3 id="org0d4a3f0"><span class="section-number-3">1.2</span> Independent Study Course, This One</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Title: Blockchains, IPFS, NuCypher, and dApps</li>
</ol>
</div>
</div>

<div id="outline-container-orge14e612" class="outline-3">
<h3 id="orge14e612"><span class="section-number-3">1.3</span> Overview</h3>
<div class="outline-text-3" id="text-1-3">
<ol class="org-ol">
<li>The New Decentralized Future.</li>
<li>Private Data on a Public Blockchain</li>
<li>Concepts: Decentralized content storage network.</li>
</ol>
</div>
</div>

<div id="outline-container-org5447d6b" class="outline-3">
<h3 id="org5447d6b"><span class="section-number-3">1.4</span> IPFS</h3>
<div class="outline-text-3" id="text-1-4">
<ol class="org-ol">
<li>IPFS: The decentralized content storage network.  Uncensorable.
Undeletable.  Distributed across countries.</li>
</ol>
</div>
</div>

<div id="outline-container-orgdea2490" class="outline-3">
<h3 id="orgdea2490"><span class="section-number-3">1.5</span> NuCypher</h3>
<div class="outline-text-3" id="text-1-5">
<ol class="org-ol">
<li>NuCypher.  The privacy layer.  Building the Applications and Tools
for Unconditional Privacy.  A proxy re-encryption network to
empower privacy in decentralized systems.</li>

<li>"NuCypher KMS: Uncensorable decentralized encryption service"</li>
</ol>
</div>
</div>

<div id="outline-container-orgf0ec878" class="outline-3">
<h3 id="orgf0ec878"><span class="section-number-3">1.6</span> dApps</h3>
<div class="outline-text-3" id="text-1-6">
<ol class="org-ol">
<li>"DApps are decentralized applications where no single entity has
the power to control that app because it is deployed on a
distributed blockchain ledger."</li>

<li><a href="https://www.stateofthedapps.com/whats-a-dapp">https://www.stateofthedapps.com/whats-a-dapp</a></li>
<li>9 Best DApps On Ethereum Platform <a href="https://coinsutra.com/ethereum-dapps/">https://coinsutra.com/ethereum-dapps/</a></li>
<li><a href="https://app.co/ipfs">https://app.co/ipfs</a> Universal dapp store - discover decentralized
apps.  IPFS. Rank. Auth. Storage.  Blockchain. Tweets/Week.
Filesharing App and IPFS node on Android.</li>

<li><a href="https://www.stateofthedapps.com/dapps/nucypher">https://www.stateofthedapps.com/dapps/nucypher</a></li>
</ol>
</div>
</div>

<div id="outline-container-org10a9c8e" class="outline-3">
<h3 id="org10a9c8e"><span class="section-number-3">1.7</span> Topics Beyond the Scope of this Study</h3>
<div class="outline-text-3" id="text-1-7">
<ol class="org-ol">
<li>Not exhaustive.</li>

<li><a href="https://www.originprotocol.com/">https://www.originprotocol.com/</a> Origin is a protocol for creating
peer-to-peer marketplaces using the Ethereum blockchain and IPFS</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9f5178b" class="outline-2">
<h2 id="org9f5178b"><span class="section-number-2">2</span> Capstone Project</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>What is a Capstone Project? As a project, how extensive must it be?
What are the deliverables?</li>

<li>Definition of privacy: We do not have a definition (as of 2019) of
what privacy is.  TBD Link explains via examples.  TBD Browse the
content of eff.org. <a href="https://www.eff.org/issues/privacy">https://www.eff.org/issues/privacy</a></li>
</ol>
</div>

<div id="outline-container-org2447569" class="outline-3">
<h3 id="org2447569"><span class="section-number-3">2.1</span> Jayal's Project</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Design and build a dApp whose functionality matches
<a href="https://keepass.info/">https://keepass.info/</a>, a free, open source, light-weight and
easy-to-use password manager.</li>
</ol>
</div>
</div>

<div id="outline-container-orgeeb735c" class="outline-3">
<h3 id="orgeeb735c"><span class="section-number-3">2.2</span> Must Do</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Install metamask.</li>
</ol>
</div>
</div>


<div id="outline-container-org56cd57b" class="outline-3">
<h3 id="org56cd57b"><span class="section-number-3">2.3</span> Hako</h3>
<div class="outline-text-3" id="text-2-3">
<ol class="org-ol">
<li><a href="https://github.com/drbh/hako">https://github.com/drbh/hako</a> Mar 2019 "Unlike other file sharing
services such as Dropbox and Google Drive, Hako does not place your
keys in the hands of a large companies. The user is always in
control of your keys and your data."</li>

<li>Centralized storage has a single point of failure (the company) and
require a user to be online (connected to the central servers) in
order to transfer data and delegate access.</li>

<li>It consists of a library called NCIPFS and the application
Hako. Hako is powered by NCIPFS and is provides a REST interface
and web-app to the underlying methods of NCIPFS.</li>

<li>Futari</li>
<li>NUCID</li>
</ol>
</div>
</div>

<div id="outline-container-org0b85c3f" class="outline-3">
<h3 id="org0b85c3f"><span class="section-number-3">2.4</span> NuCypher Chrome Extension</h3>
<div class="outline-text-3" id="text-2-4">
<ol class="org-ol">
<li><a href="https://github.com/if1242/NuCypherChromeExtensionCoinlistHack">https://github.com/if1242/NuCypherChromeExtensionCoinlistHack</a> by
Ivan Fedorov. The NuCypher Google Chrome Extension helps "sharing
your datafiles in a safe way using NuCypher technology. &#x2026;  The
extension is fully functional and you can try it in action after
installation."
<a href="https://www.youtube.com/watch?v=pmoMzzIR458&amp;feature=youtu.be">https://www.youtube.com/watch?v=pmoMzzIR458&amp;feature=youtu.be</a> 1:19
Apr 2019</li>
<li>Native Messaging protocol</li>
</ol>
</div>
</div>


<div id="outline-container-org58f6614" class="outline-3">
<h3 id="org58f6614"><span class="section-number-3">2.5</span> Appendices</h3>
<div class="outline-text-3" id="text-2-5">
<ol class="org-ol">
<li>Installation Reports.  On each item installed.  Collect the actual
logs (e.g., via the command named <code>script</code>), and then overlay a
section/subsection structure on it.</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org165bf91" class="outline-2">
<h2 id="org165bf91"><span class="section-number-2">3</span> Example dApps</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li><a href="https://www.stateofthedapps.com/dapps/smartcheck">https://www.stateofthedapps.com/dapps/smartcheck</a> Mar 2018
SmartCheck - is a static analyzer for Solidity programming
language. It automatically checks Smart Contracts for
vulnerabilities and bad practices, highlights them in the code and
gives a detailed explanation of the problem. Free version of the
tool is available online: you can scan your Solidity code right
now. All you need to do is to upload the code of any contract
written in Solidity (drop .sol files/folders or paste the code) ,
click “Submit for scan” button and wait for several seconds.</li>

<li><a href="https://securify.chainsecurity.com/?utm_source=StateOfTheDApps">https://securify.chainsecurity.com/?utm_source=StateOfTheDApps</a>
Security Scanner for Ethereum Smart Contracts.  The Ethereum
security scanner is based on the latest research from the ICE
center, ETH Zurich. <a href="https://arxiv.org/pdf/1806.01143.pdf">https://arxiv.org/pdf/1806.01143.pdf</a> ACM CCS
2018</li>
</ol>
</div>
</div>

<div id="outline-container-org5851496" class="outline-2">
<h2 id="org5851496"><span class="section-number-2">4</span> Snowden</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://coinlist.co/build/nucypher/projects/0ca13d4e-c809-482a-8ca6-1f094f74eff7">https://coinlist.co/build/nucypher/projects/0ca13d4e-c809-482a-8ca6-1f094f74eff7</a>
WEBSITE  <a href="http://snowden.tilda.ws/">http://snowden.tilda.ws/</a> GITHUB
<a href="https://github.com/MikaelLazarev/Snowden">https://github.com/MikaelLazarev/Snowden</a> VIDEO  <a href="https://youtu.be/0A6qDbi1MnI">https://youtu.be/0A6qDbi1MnI</a></li>

<li>Unclear details of installation.  Shebang is not the same.  On
Ubuntu, even the <code>source</code> is missing in some shells.</li>
</ol>
</div>
</div>


<div id="outline-container-orgc68b065" class="outline-2">
<h2 id="orgc68b065"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>Blockchains.  Book <a href="https://bitcoinbook.cs.princeton.edu/">https://bitcoinbook.cs.princeton.edu/</a>; YouTube
play list
<a href="https://www.youtube.com/watch?v=fOMVZXLjKYo&amp;list=PLQIX_E46U4XYE5GR6029FpnaX9aBXbt0B">https://www.youtube.com/watch?v=fOMVZXLjKYo&amp;list=PLQIX_E46U4XYE5GR6029FpnaX9aBXbt0B</a></li>
<li>Intro to IPFS and dApps by Prabhaker Mateti
<a href="https://cecs.wright.edu/~pmateti/Research/IPFS/Lectures/">https://cecs.wright.edu/~pmateti/Research/IPFS/Lectures/</a></li>
<li>NuCypher <a href="https://github.com/nucypher">https://github.com/nucypher</a>;
<a href="https://docs.nucypher.com/en/latest/guides/installation_guide.html">https://docs.nucypher.com/en/latest/guides/installation_guide.html</a></li>
<li>dApps <a href="https://www.stateofthedapps.com/">https://www.stateofthedapps.com/</a></li>
<li>NCIPFS Third place winner in the NuCypher + Coinlist Hackathon
March 2019.  A developer friendly python library to easily store,
encrypt, share and decrypt data on IPFS with NuCypher's proxy
re-encryption. <a href="https://coinlist.co/build/nucypher/votes">https://coinlist.co/build/nucypher/votes</a>,</li>

<li><a href="https://metamask.io/">https://metamask.io/</a> MetaMask is a bridge that allows you to visit
the distributed web of tomorrow in your browser today. It allows
you to run Ethereum dApps right in your browser &#x2026;</li>

<li><a href="https://www.youtube.com/results?search_query=nucypher">https://www.youtube.com/results?search_query=nucypher</a> Several
videos on YouTube.  Have not watched them yet.</li>

<li><a href="https://cryptozombies.io/">https://cryptozombies.io/</a> CryptoZombies is a free, interactive code
school that teaches you to build games on Ethereum.</li>
</ol>
</div>
</div>


<div id="outline-container-orge378342" class="outline-2">
<h2 id="orge378342"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr />Copyright &copy; 2019 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2019-05-05
</div>
</body>
</html>
